Repository: makinacorpus/drupal-gulpifier
Catalog: translations/*.po
Languages: fr

source: Override Global Settings
fr: Surcharge des paramètres globaux

source: Gulpifier settings
fr: Paramétrage de Gulpifier

source: Enable Gulpifier for this theme
fr: Activer Gulpifier pour ce thème

source: Enable JS discovery
fr: Activer La découverte des fichiers JS

source: In this mode, a JSON map of the JS files used will be built upon each page request. You can manually edit it to exclude some files, or reorder the files between them.
fr: Dans ce mode, la map JSON des fichiers JS utilisés est construite à chaque appel de page. Vous pouvez la modifier manuellement pour exclure certains fichiers, ou les réordonner.

source: Path to the map.json file
fr: Chemin vers le fichier map.json

source: The path to the JSON map. It is advised to track it within your VCS, most probably in the theme.
fr: Le chemin vers la map JSON. Il est conseillé de la suivre avec votre gestionnaire de version, normalement dans le thème.

source: Enable single JS file (production mode)
fr: Activer le fichier JS unique (mode production)

source: In this mode, all JS files that are not in the whitelist are removed, and replaced with the one generated by Gulp.
fr: Dans ce mode, tous les fichiers JS qui ne sont pas dans la liste blanche sont retirés, et remplacés par celui généré par Gulp.

source: Enable grouping of remaining JS files
fr: Activer le regroupement des fichiers JS restant

source: All JS files that are not in the bundle are grouped for aggregation.
fr: Tous les fichiers JS qui ne sont pas dans le bundle seront aggrégés.

source: Move all remaining JS files in the <em>header</em> scope.
fr: Déplacer les fichiers JS restant dans le scope <em>header</em>.

source: All JS files that are not in the header scope are moved to ease aggregation.
fr: Tous les fichiers JS qui ne sont pas dans le scope header sont déplacés pour faciliter l'aggrégation.

source: Enable single CSS file (production mode)
fr: Activer le fichier CSS unique (mode production)

source: In this mode, all CSS files that are not in the whitelist are removed, and replaced with the one generated by Gulp.
fr: Dans ce mode, tous les fichiers CSS qui ne sont pas dans la liste blanche sont retirés, et remplacés par celui généré par Gulp.

source: Enable grouping of remaining CSS files
fr: Activer le regroupement des fichiers CSS restant

source: All CSS files that are not in the bundle are grouped for aggregation.
fr: Tous les fichiers CSS qui ne sont pas dans le bundle seront aggrégés.

source: The path to the JSON map is required if discovery is enabled.
fr: Le chemin vers la map JSON est requis si la découverte est activée.

source: The path to the JSON map must point to a existing file.
fr: Le chemin vers la map JSON doit pointer vers un fichier existant.
